[Survived] ObjectLiteral
app/(tabs)/browse.tsx:18:3
 const data: Listing[] = [
-  { id: '3', source: require('../../assets/images/image3.jpg'), name: 'Bicicleta Usada', price: '$100', description: 'Poco uso, info: 312-194-1948', condition: 'Usada', },
+  {},
 ];
 

[Survived] StringLiteral
app/(tabs)/browse.tsx:18:161
 const data: Listing[] = [
-  { id: '3', source: require('../../assets/images/image3.jpg'), name: 'Bicicleta Usada', price: '$100', description: 'Poco uso, info: 312-194-1948', condition: 'Usada', },
+  { id: '3', source: require('../../assets/images/image3.jpg'), name: 'Bicicleta Usada', price: '$100', description: 'Poco uso, info: 312-194-1948', condition: "", },
 ];
 

[Survived] BooleanLiteral
app/(tabs)/browse.tsx:23:52
 
 export default function BrowseScreen() {
   const [cartListings, setCartListings] = useState<Listing[]>([]);
-  const [modalVisible, setModalVisible] = useState(false);
+  const [modalVisible, setModalVisible] = useState(true);
   const [detailModalVisible, setDetailModalVisible] = useState(false);
   const [selectedListing, setSelectedListing] = useState<Listing | null>(null);

[Survived] BooleanLiteral
app/(tabs)/browse.tsx:24:64
 export default function BrowseScreen() {
   const [cartListings, setCartListings] = useState<Listing[]>([]);
   const [modalVisible, setModalVisible] = useState(false);
-  const [detailModalVisible, setDetailModalVisible] = useState(false);
+  const [detailModalVisible, setDetailModalVisible] = useState(true);
   const [selectedListing, setSelectedListing] = useState<Listing | null>(null);
 

[Survived] BlockStatement
app/(tabs)/browse.tsx:28:48
   const [selectedListing, setSelectedListing] = useState<Listing | null>(null);
 
 
-  const updateCartList = (listing: Listing) => {
-    setCartListings(prevListings => [...prevListings, listing]);
-  };
+  const updateCartList = (listing: Listing) => {};
 
   const removeItemFromCart = (id: string) => {

[Survived] ArrowFunction
app/(tabs)/browse.tsx:29:21
 
 
   const updateCartList = (listing: Listing) => {
-    setCartListings(prevListings => [...prevListings, listing]);
+    setCartListings(() => undefined);
   };
 

[Survived] BlockStatement
app/(tabs)/browse.tsx:32:46
     setCartListings(prevListings => [...prevListings, listing]);
   };
 
-  const removeItemFromCart = (id: string) => {
-    setCartListings(prevListings => prevListings.filter(listing => listing.id !== id));
-  };
+  const removeItemFromCart = (id: string) => {};
 
   const showDetailModal = (listing: Listing) => {

[Survived] MethodExpression
app/(tabs)/browse.tsx:33:37
   };
 
   const removeItemFromCart = (id: string) => {
-    setCartListings(prevListings => prevListings.filter(listing => listing.id !== id));
+    setCartListings(prevListings => prevListings);
   };
 

[Survived] ArrowFunction
app/(tabs)/browse.tsx:33:57
   };
 
   const removeItemFromCart = (id: string) => {
-    setCartListings(prevListings => prevListings.filter(listing => listing.id !== id));
+    setCartListings(prevListings => prevListings.filter(() => undefined));
   };
 

[Survived] BlockStatement
app/(tabs)/browse.tsx:36:49
     setCartListings(prevListings => prevListings.filter(listing => listing.id !== id));
   };
 
-  const showDetailModal = (listing: Listing) => {
-    setSelectedListing(listing);
-    setDetailModalVisible(true);
-    console.log('showDetailModal', listing);
-  };
+  const showDetailModal = (listing: Listing) => {};
 
   const renderItem = ({ item }: { item: Listing }) => (

[Survived] BooleanLiteral
app/(tabs)/browse.tsx:38:27
 
   const showDetailModal = (listing: Listing) => {
     setSelectedListing(listing);
-    setDetailModalVisible(true);
+    setDetailModalVisible(false);
     console.log('showDetailModal', listing);
   };

[Survived] ArrowFunction
app/(tabs)/browse.tsx:42:22
     console.log('showDetailModal', listing);
   };
 
-  const renderItem = ({ item }: { item: Listing }) => (
-    <TouchableOpacity onPress={() => showDetailModal(item)} testID={`item-${item.id}`}>
-      <RoundedSquareImage
-        source={item.source}
-        name={item.name}
-        price={item.price}
-        description={item.description}
-        updateCartList={updateCartList}
-        onPress={() => showDetailModal(item)}
-      />
-    </TouchableOpacity>
-  );
+  const renderItem = () => undefined;
 
   return (

[Survived] ArrowFunction
app/(tabs)/browse.tsx:43:32
   };
 
   const renderItem = ({ item }: { item: Listing }) => (
-    <TouchableOpacity onPress={() => showDetailModal(item)} testID={`item-${item.id}`}>
+    <TouchableOpacity onPress={() => undefined} testID={`item-${item.id}`}>
       <RoundedSquareImage
         source={item.source}

[Survived] ArrowFunction
app/(tabs)/browse.tsx:50:18
         price={item.price}
         description={item.description}
         updateCartList={updateCartList}
-        onPress={() => showDetailModal(item)}
+        onPress={() => undefined}
       />
     </TouchableOpacity>

[Survived] ArrowFunction
app/(tabs)/browse.tsx:59:36
     <View style={styles.container}>
       <View style={styles.header}>
         {/* Render the title here */}
-        <TouchableOpacity onPress={() => showDetailModal(data[0])}>
+        <TouchableOpacity onPress={() => undefined}>
           <Text style={styles.title}>Title</Text>
         </TouchableOpacity>

[Killed] ArrowFunction
app/(tabs)/browse.tsx:68:22
             color="#fff"
             size={25}
             testID="cart-icon"
-            onPress={() => setModalVisible(true)}
+            onPress={() => undefined}
           />
           {cartListings.length > 0 && (
killedBy: BrowseScreen opens cart modal on cart icon press
statusReason: Error: Unable to find an element with text: Cart

<View>
  <View>
    <View
      accessible={true}
    >
      <Text>

[Killed] BooleanLiteral
app/(tabs)/browse.tsx:68:44
             color="#fff"
             size={25}
             testID="cart-icon"
-            onPress={() => setModalVisible(true)}
+            onPress={() => setModalVisible(false)}
           />
           {cartListings.length > 0 && (
killedBy: BrowseScreen opens cart modal on cart icon press
statusReason: Error: Unable to find an element with text: Cart

<View>
  <View>
    <View
      accessible={true}
    >
      <Text>

[Survived] ConditionalExpression
app/(tabs)/browse.tsx:70:12
             testID="cart-icon"
             onPress={() => setModalVisible(true)}
           />
-          {cartListings.length > 0 && (
-            <Badge style={styles.badge}>{cartListings.length}</Badge>
-          )}
+          {false}
         </View>
       </View>

[Survived] EqualityOperator
app/(tabs)/browse.tsx:70:12
             testID="cart-icon"
             onPress={() => setModalVisible(true)}
           />
-          {cartListings.length > 0 && (
+          {cartListings.length <= 0 && (
             <Badge style={styles.badge}>{cartListings.length}</Badge>
           )}

[Survived] ArrowFunction
app/(tabs)/browse.tsx:85:23
       <FlatList
         data={data}
         renderItem={renderItem}
-        keyExtractor={item => item.id}
+        keyExtractor={() => undefined}
         contentContainerStyle={styles.flatListContent}
       />

[Survived] BooleanLiteral
app/(tabs)/browse.tsx:91:22
 
       <Modal
         animationType="slide"
-        transparent={true}
+        transparent={false}
         visible={detailModalVisible}
         onRequestClose={() => setDetailModalVisible(false)}

[Survived] ArrowFunction
app/(tabs)/browse.tsx:93:25
         animationType="slide"
         transparent={true}
         visible={detailModalVisible}
-        onRequestClose={() => setDetailModalVisible(false)}
+        onRequestClose={() => undefined}
       >
         <View style={styles.modalContainer}>

[Survived] BooleanLiteral
app/(tabs)/browse.tsx:93:53
         animationType="slide"
         transparent={true}
         visible={detailModalVisible}
-        onRequestClose={() => setDetailModalVisible(false)}
+        onRequestClose={() => setDetailModalVisible(true)}
       >
         <View style={styles.modalContainer}>

[Killed] OptionalChaining
app/(tabs)/browse.tsx:98:48
         <View style={styles.modalContainer}>
           <View style={styles.modalContent}>
             <View style={styles.modalHeader}>
-              <Text style={styles.modalTitle}>{selectedListing?.name}</Text>
+              <Text style={styles.modalTitle}>{selectedListing.name}</Text>
               <IconButton
                 icon="close"
killedBy: BrowseScreen renders correctly
statusReason: TypeError: Cannot read properties of null (reading 'name')

[Survived] ArrowFunction
app/(tabs)/browse.tsx:103:26
                 icon="close"
                 color="#000"
                 size={24}
-                onPress={() => setDetailModalVisible(false)}
+                onPress={() => undefined}
                 style={styles.closeButton}
               />

[Survived] BooleanLiteral
app/(tabs)/browse.tsx:103:54
                 icon="close"
                 color="#000"
                 size={24}
-                onPress={() => setDetailModalVisible(false)}
+                onPress={() => setDetailModalVisible(true)}
                 style={styles.closeButton}
               />

[Killed] LogicalOperator
app/(tabs)/browse.tsx:108:16
               />
             </View>
             <View style={{flexDirection:"row"}}>
-              {selectedListing && <Image source={selectedListing.source} style={styles.imagepopup} />}
+              {selectedListing || <Image source={selectedListing.source} style={styles.imagepopup} />}
               <View style={{marginLeft:5, paddingLeft:5}}>
                 <Text style={styles.topicTitle}>Description</Text>
killedBy: BrowseScreen renders correctly
statusReason: TypeError: Cannot read properties of null (reading 'source')

[Survived] ConditionalExpression
app/(tabs)/browse.tsx:108:16
               />
             </View>
             <View style={{flexDirection:"row"}}>
-              {selectedListing && <Image source={selectedListing.source} style={styles.imagepopup} />}
+              {false}
               <View style={{marginLeft:5, paddingLeft:5}}>
                 <Text style={styles.topicTitle}>Description</Text>

[Survived] ObjectLiteral
app/(tabs)/browse.tsx:109:28
             </View>
             <View style={{flexDirection:"row"}}>
               {selectedListing && <Image source={selectedListing.source} style={styles.imagepopup} />}
-              <View style={{marginLeft:5, paddingLeft:5}}>
+              <View style={{}}>
                 <Text style={styles.topicTitle}>Description</Text>
                 <Text style={{fontSize: 20}}>{selectedListing?.description}</Text>

[Killed] OptionalChaining
app/(tabs)/browse.tsx:111:47
               {selectedListing && <Image source={selectedListing.source} style={styles.imagepopup} />}
               <View style={{marginLeft:5, paddingLeft:5}}>
                 <Text style={styles.topicTitle}>Description</Text>
-                <Text style={{fontSize: 20}}>{selectedListing?.description}</Text>
+                <Text style={{fontSize: 20}}>{selectedListing.description}</Text>
                 <Text style={styles.topicTitle}>Price</Text>
                 <Text style={{fontSize: 20}}>{selectedListing?.price}</Text>
killedBy: BrowseScreen renders correctly
statusReason: TypeError: Cannot read properties of null (reading 'description')

[Killed] OptionalChaining
app/(tabs)/browse.tsx:113:47
                 <Text style={styles.topicTitle}>Description</Text>
                 <Text style={{fontSize: 20}}>{selectedListing?.description}</Text>
                 <Text style={styles.topicTitle}>Price</Text>
-                <Text style={{fontSize: 20}}>{selectedListing?.price}</Text>
+                <Text style={{fontSize: 20}}>{selectedListing.price}</Text>
                 <Text style={styles.topicTitle}>Conditions</Text>
                 <Text style={{fontSize: 20}}>{selectedListing?.condition}</Text>
killedBy: BrowseScreen renders correctly
statusReason: TypeError: Cannot read properties of null (reading 'price')

[Killed] OptionalChaining
app/(tabs)/browse.tsx:115:47
                 <Text style={styles.topicTitle}>Price</Text>
                 <Text style={{fontSize: 20}}>{selectedListing?.price}</Text>
                 <Text style={styles.topicTitle}>Conditions</Text>
-                <Text style={{fontSize: 20}}>{selectedListing?.condition}</Text>
+                <Text style={{fontSize: 20}}>{selectedListing.condition}</Text>
             </View>
             </View>
killedBy: BrowseScreen renders correctly
statusReason: TypeError: Cannot read properties of null (reading 'condition')

[Survived] ObjectLiteral
app/(tabs)/browse.tsx:115:30
                 <Text style={styles.topicTitle}>Price</Text>
                 <Text style={{fontSize: 20}}>{selectedListing?.price}</Text>
                 <Text style={styles.topicTitle}>Conditions</Text>
-                <Text style={{fontSize: 20}}>{selectedListing?.condition}</Text>
+                <Text style={{}}>{selectedListing?.condition}</Text>
             </View>
             </View>

[Survived] BooleanLiteral
app/(tabs)/browse.tsx:126:47
         animationType="slide"
         transparent={true}
         visible={modalVisible}
-        onRequestClose={() => setModalVisible(false)}
+        onRequestClose={() => setModalVisible(true)}
       >
         <View style={styles.modalContainer}>

[Survived] ArrowFunction
app/(tabs)/browse.tsx:126:25
         animationType="slide"
         transparent={true}
         visible={modalVisible}
-        onRequestClose={() => setModalVisible(false)}
+        onRequestClose={() => undefined}
       >
         <View style={styles.modalContainer}>

[Survived] ArrowFunction
app/(tabs)/browse.tsx:136:26
                 icon="close"
                 color="#000"
                 size={24}
-                onPress={() => setModalVisible(false)}
+                onPress={() => undefined}
                 style={styles.closeButton}
               />

[Survived] BooleanLiteral
app/(tabs)/browse.tsx:136:48
                 icon="close"
                 color="#000"
                 size={24}
-                onPress={() => setModalVisible(false)}
+                onPress={() => setModalVisible(true)}
                 style={styles.closeButton}
               />

[Survived] ArrowFunction
app/(tabs)/browse.tsx:140:31
                 style={styles.closeButton}
               />
             </View>
-            {cartListings.map(listing => (
-              <View style={styles.cartItem} key={listing.id}>
-                <View style={styles.imageContainer}>
-                  <Image source={listing.source} style={styles.image} />
-                </View>
-                <View style={styles.details}>
-                  <Text style={styles.name}>{listing.name}</Text>
-                  <Text style={styles.price}>{listing.price}</Text>
-                </View>
-                <IconButton
-                  icon="delete"
-                  color="#000"
-                  size={24}
-                  onPress={() => removeItemFromCart(listing.id)}
-                  style={styles.removeButton}
-                />
-              </View>
-            ))}
+            {cartListings.map(() => undefined)}
           </View>
         </View>

[Survived] ArrowFunction
app/(tabs)/browse.tsx:153:28
                   icon="delete"
                   color="#000"
                   size={24}
-                  onPress={() => removeItemFromCart(listing.id)}
+                  onPress={() => undefined}
                   style={styles.removeButton}
                 />

[Survived] ObjectLiteral
app/(tabs)/browse.tsx:171:11
     alignItems: 'center',
     paddingTop: 40,
   },
-  header: {
-    flexDirection: 'row',
-    justifyContent: 'space-between',
-    alignItems: 'center',
-    width: '100%',
-    paddingHorizontal: 20,
-    marginBottom: 0,
-    marginTop: -20
-  },
+  header: {},
   title: {
     fontSize: 20,

[Survived] UnaryOperator
app/(tabs)/browse.tsx:178:16
     width: '100%',
     paddingHorizontal: 20,
     marginBottom: 0,
-    marginTop: -20
+    marginTop: +20
   },
   title: {

[Survived] StringLiteral
app/(tabs)/browse.tsx:185:15
     fontWeight: 'bold',
   },
   cartIconContainer: {
-    position: 'relative',
+    position: "",
     flexDirection: 'row',
     alignItems: 'center',

[Survived] StringLiteral
app/(tabs)/browse.tsx:186:20
   },
   cartIconContainer: {
     position: 'relative',
-    flexDirection: 'row',
+    flexDirection: "",
     alignItems: 'center',
     marginTop: -0 

[Survived] UnaryOperator
app/(tabs)/browse.tsx:188:16
     position: 'relative',
     flexDirection: 'row',
     alignItems: 'center',
-    marginTop: -0 
+    marginTop: +0 
   },
   badge: {

[Survived] UnaryOperator
app/(tabs)/browse.tsx:192:10
   },
   badge: {
     position: 'absolute',
-    top: -5,
+    top: +5,
     right: -5,
   },

[Survived] UnaryOperator
app/(tabs)/browse.tsx:193:12
   badge: {
     position: 'absolute',
     top: -5,
-    right: -5,
+    right: +5,
   },
   

[Survived] ObjectLiteral
app/(tabs)/browse.tsx:196:14
     right: -5,
   },
   
-  searchBar: {
-    width: '90%',
-    backgroundColor: '#ffffff',
-    borderRadius: 8,
-    paddingHorizontal: 10,
-    paddingVertical: 5,
-    marginTop: 20,
-  },
+  searchBar: {},
   input: {
     fontSize: 16,

[Survived] ObjectLiteral
app/(tabs)/browse.tsx:204:10
     paddingVertical: 5,
     marginTop: 20,
   },
-  input: {
-    fontSize: 16,
-    color: '#333',
-  },
+  input: {},
   flatListContent: {
     paddingTop: 20,

[Survived] StringLiteral
app/(tabs)/browse.tsx:206:12
   },
   input: {
     fontSize: 16,
-    color: '#333',
+    color: "",
   },
   flatListContent: {

[Survived] ObjectLiteral
app/(tabs)/browse.tsx:218:17
     alignItems: 'center',
     backgroundColor: 'rgba(0, 0, 0, 0.5)',
   },
-  modalContent: {
-    backgroundColor: '#fff',
-    borderRadius: 8,
-    padding: 20,
-    width: '80%',
-    maxHeight: '80%',
-  },
+  modalContent: {},
   modalHeader: {
     flexDirection: 'row',

[Survived] StringLiteral
app/(tabs)/browse.tsx:222:12
     backgroundColor: '#fff',
     borderRadius: 8,
     padding: 20,
-    width: '80%',
+    width: "",
     maxHeight: '80%',
   },

[Survived] ObjectLiteral
app/(tabs)/browse.tsx:236:13
     fontWeight: 'bold',
     marginBottom: 10,
   },
-  cartItem: {
-    flexDirection: 'row',
-    alignItems: 'center',
-    marginBottom: 10,
-  },
+  cartItem: {},
   imageContainer: {
     marginRight: 10,

[Survived] StringLiteral
app/(tabs)/browse.tsx:237:20
     marginBottom: 10,
   },
   cartItem: {
-    flexDirection: 'row',
+    flexDirection: "",
     alignItems: 'center',
     marginBottom: 10,

[Survived] ObjectLiteral
app/(tabs)/browse.tsx:244:10
   imageContainer: {
     marginRight: 10,
   },
-  image: {
-    width: 50,
-    height: 50,
-    resizeMode: 'cover',
-    borderRadius: 10,
-  },
+  image: {},
   details: {
     flex: 1,

[Survived] StringLiteral
app/(tabs)/browse.tsx:247:17
   image: {
     width: 50,
     height: 50,
-    resizeMode: 'cover',
+    resizeMode: "",
     borderRadius: 10,
   },

[Survived] ObjectLiteral
app/(tabs)/browse.tsx:250:12
     resizeMode: 'cover',
     borderRadius: 10,
   },
-  details: {
-    flex: 1,
-  },
+  details: {},
   name: {
     fontSize: 16,

[Survived] StringLiteral
app/(tabs)/browse.tsx:262:17
     color: '#888',
   },
   removeButton: {
-    marginLeft: 'auto',
+    marginLeft: "",
   },
   closeButton: {

[Survived] StringLiteral
app/(tabs)/browse.tsx:265:17
     marginLeft: 'auto',
   },
   closeButton: {
-    marginLeft: 'auto',
+    marginLeft: "",
   },
   imagepopup: {

[Survived] ObjectLiteral
app/(tabs)/browse.tsx:271:15
     width: 500,
     height: 500,
   },
-  topicTitle: {
-    fontSize: 18,
-    fontWeight: 'bold',
-  },
+  topicTitle: {},
 });
 

[Survived] StringLiteral
app/(tabs)/browse.tsx:273:17
   },
   topicTitle: {
     fontSize: 18,
-    fontWeight: 'bold',
+    fontWeight: "",
   },
 });
