[Survived] BlockStatement
app/(tabs)/personal-storefront.tsx:5:33
 import { View, Text, Image, FlatList, Modal, StyleSheet, TouchableOpacity, TextInput, ScrollView } from 'react-native';
 import { IconButton } from 'react-native-paper';
 
-const renderStars = (rating) => {
-  const filledStars = '★'.repeat(rating);
-  const emptyStars = '☆'.repeat(5 - rating);
-  return filledStars + emptyStars;
-};
+const renderStars = (rating) => {};
 
 // Hardcoded banners to test

[Survived] ArithmeticOperator
app/(tabs)/personal-storefront.tsx:7:33
 
 const renderStars = (rating) => {
   const filledStars = '★'.repeat(rating);
-  const emptyStars = '☆'.repeat(5 - rating);
+  const emptyStars = '☆'.repeat(5 + rating);
   return filledStars + emptyStars;
 };

[Survived] ArithmeticOperator
app/(tabs)/personal-storefront.tsx:8:10
 const renderStars = (rating) => {
   const filledStars = '★'.repeat(rating);
   const emptyStars = '☆'.repeat(5 - rating);
-  return filledStars + emptyStars;
+  return filledStars - emptyStars;
 };
 

[Survived] ArrayDeclaration
app/(tabs)/personal-storefront.tsx:12:17
 };
 
 // Hardcoded banners to test
-const banners = [
-  require('../../assets/images/banner.jpg'),
-  require('../../assets/images/profile-picture-default.png'),
-  require('../../assets/images/banner.jpg'),
-  require('../../assets/images/banner.jpg'),
-  require('../../assets/images/profile-picture-default.png'),
-  require('../../assets/images/banner.jpg'),
-];
+const banners = [];
 
 // Hardcoded profile pictures to test

[Killed] BooleanLiteral
app/(tabs)/personal-storefront.tsx:41:160
 
 const PersonalStorefrontPage = () => {
   const [userItems, setUserItems] = useState([
-    { id: '1', itemName: 'Lab Coat', itemPrice: '$50', category: 'Clothing', itemImage: require('../../assets/images/image4.jpg'), status: 'In Stock', pinned: false },
+    { id: '1', itemName: 'Lab Coat', itemPrice: '$50', category: 'Clothing', itemImage: require('../../assets/images/image4.jpg'), status: 'In Stock', pinned: true },
     { id: '2', itemName: 'Lab Goggles', itemPrice: '$15', category: 'Clothing', itemImage: require('../../assets/images/image5.jpg'), status: 'Out of Stock', pinned: false },
   ]);
killedBy: PersonalStorefrontPage should pin an item
statusReason: Error: Unable to find an element with testID: pinButton-1

<View>
  <Image />
  <View>
    <View
      testID="profileBannerIcon-container-outer-layer"
    >

[Killed] StringLiteral
app/(tabs)/personal-storefront.tsx:41:11
 
 const PersonalStorefrontPage = () => {
   const [userItems, setUserItems] = useState([
-    { id: '1', itemName: 'Lab Coat', itemPrice: '$50', category: 'Clothing', itemImage: require('../../assets/images/image4.jpg'), status: 'In Stock', pinned: false },
+    { id: "", itemName: 'Lab Coat', itemPrice: '$50', category: 'Clothing', itemImage: require('../../assets/images/image4.jpg'), status: 'In Stock', pinned: false },
     { id: '2', itemName: 'Lab Goggles', itemPrice: '$15', category: 'Clothing', itemImage: require('../../assets/images/image5.jpg'), status: 'Out of Stock', pinned: false },
   ]);
killedBy: PersonalStorefrontPage should pin an item
statusReason: Error: Unable to find an element with testID: pinButton-1

<View>
  <Image />
  <View>
    <View
      testID="profileBannerIcon-container-outer-layer"
    >

[Survived] BooleanLiteral
app/(tabs)/personal-storefront.tsx:42:167
 const PersonalStorefrontPage = () => {
   const [userItems, setUserItems] = useState([
     { id: '1', itemName: 'Lab Coat', itemPrice: '$50', category: 'Clothing', itemImage: require('../../assets/images/image4.jpg'), status: 'In Stock', pinned: false },
-    { id: '2', itemName: 'Lab Goggles', itemPrice: '$15', category: 'Clothing', itemImage: require('../../assets/images/image5.jpg'), status: 'Out of Stock', pinned: false },
+    { id: '2', itemName: 'Lab Goggles', itemPrice: '$15', category: 'Clothing', itemImage: require('../../assets/images/image5.jpg'), status: 'Out of Stock', pinned: true },
   ]);
   const allowedCategories = ["Book", "Clothing", "Tools", "Furniture"];

[Survived] StringLiteral
app/(tabs)/personal-storefront.tsx:42:52
 const PersonalStorefrontPage = () => {
   const [userItems, setUserItems] = useState([
     { id: '1', itemName: 'Lab Coat', itemPrice: '$50', category: 'Clothing', itemImage: require('../../assets/images/image4.jpg'), status: 'In Stock', pinned: false },
-    { id: '2', itemName: 'Lab Goggles', itemPrice: '$15', category: 'Clothing', itemImage: require('../../assets/images/image5.jpg'), status: 'Out of Stock', pinned: false },
+    { id: '2', itemName: 'Lab Goggles', itemPrice: "", category: 'Clothing', itemImage: require('../../assets/images/image5.jpg'), status: 'Out of Stock', pinned: false },
   ]);
   const allowedCategories = ["Book", "Clothing", "Tools", "Furniture"];

[Killed] ArrayDeclaration
app/(tabs)/personal-storefront.tsx:44:29
     { id: '1', itemName: 'Lab Coat', itemPrice: '$50', category: 'Clothing', itemImage: require('../../assets/images/image4.jpg'), status: 'In Stock', pinned: false },
     { id: '2', itemName: 'Lab Goggles', itemPrice: '$15', category: 'Clothing', itemImage: require('../../assets/images/image5.jpg'), status: 'Out of Stock', pinned: false },
   ]);
-  const allowedCategories = ["Book", "Clothing", "Tools", "Furniture"];
+  const allowedCategories = [];
   const filteredData = userItems.filter(item => allowedCategories.includes(item.category));
 
killedBy: PersonalStorefrontPage should pin an item
statusReason: Error: Unable to find an element with testID: pinButton-1

<View>
  <Image />
  <View>
    <View
      testID="profileBannerIcon-container-outer-layer"
    >

[Killed] ArrowFunction
app/(tabs)/personal-storefront.tsx:45:41
     { id: '2', itemName: 'Lab Goggles', itemPrice: '$15', category: 'Clothing', itemImage: require('../../assets/images/image5.jpg'), status: 'Out of Stock', pinned: false },
   ]);
   const allowedCategories = ["Book", "Clothing", "Tools", "Furniture"];
-  const filteredData = userItems.filter(item => allowedCategories.includes(item.category));
+  const filteredData = userItems.filter(() => undefined);
 
   const [userData, setUserData] = useState<StudentData>({
killedBy: PersonalStorefrontPage should pin an item
statusReason: Error: Unable to find an element with testID: pinButton-1

<View>
  <Image />
  <View>
    <View
      testID="profileBannerIcon-container-outer-layer"
    >

[Survived] MethodExpression
app/(tabs)/personal-storefront.tsx:45:24
     { id: '2', itemName: 'Lab Goggles', itemPrice: '$15', category: 'Clothing', itemImage: require('../../assets/images/image5.jpg'), status: 'Out of Stock', pinned: false },
   ]);
   const allowedCategories = ["Book", "Clothing", "Tools", "Furniture"];
-  const filteredData = userItems.filter(item => allowedCategories.includes(item.category));
+  const filteredData = userItems;
 
   const [userData, setUserData] = useState<StudentData>({

[Survived] StringLiteral
app/(tabs)/personal-storefront.tsx:50:11
   const [userData, setUserData] = useState<StudentData>({
     profilePicture: require('../../assets/images/profile-picture-default.png'),
     profileBanner: require('../../assets/images/banner.jpg'),
-    name: 'Anne Smith',
+    name: "",
     status: 'Active',
     averageRatings: 4,

[Survived] StringLiteral
app/(tabs)/personal-storefront.tsx:51:13
     profilePicture: require('../../assets/images/profile-picture-default.png'),
     profileBanner: require('../../assets/images/banner.jpg'),
     name: 'Anne Smith',
-    status: 'Active',
+    status: "",
     averageRatings: 4,
   });

[Killed] BooleanLiteral
app/(tabs)/personal-storefront.tsx:55:62
     averageRatings: 4,
   });
 
-  const [isNameModalVisible, setNameModalVisible] = useState(false);
+  const [isNameModalVisible, setNameModalVisible] = useState(true);
   const [isBannerModalVisible, setBannerModalVisible] = useState(false);
   const [isProfilePicModalVisible, setProfilePicModalVisible] = useState(false);
killedBy: PersonalStorefrontPage should change profile picture
statusReason: Error: Found multiple elements with text: Save

[Killed] BooleanLiteral
app/(tabs)/personal-storefront.tsx:56:66
   });
 
   const [isNameModalVisible, setNameModalVisible] = useState(false);
-  const [isBannerModalVisible, setBannerModalVisible] = useState(false);
+  const [isBannerModalVisible, setBannerModalVisible] = useState(true);
   const [isProfilePicModalVisible, setProfilePicModalVisible] = useState(false);
   const [newName, setNewName] = useState(userData.name);
killedBy: PersonalStorefrontPage should change profile picture
statusReason: Error: Found multiple elements with text: Save

[Killed] BooleanLiteral
app/(tabs)/personal-storefront.tsx:57:74
 
   const [isNameModalVisible, setNameModalVisible] = useState(false);
   const [isBannerModalVisible, setBannerModalVisible] = useState(false);
-  const [isProfilePicModalVisible, setProfilePicModalVisible] = useState(false);
+  const [isProfilePicModalVisible, setProfilePicModalVisible] = useState(true);
   const [newName, setNewName] = useState(userData.name);
   const [error, setError] = useState('');
killedBy: PersonalStorefrontPage should change profile banner
statusReason: Error: Found multiple elements with text: Save

[Survived] StringLiteral
app/(tabs)/personal-storefront.tsx:59:38
   const [isBannerModalVisible, setBannerModalVisible] = useState(false);
   const [isProfilePicModalVisible, setProfilePicModalVisible] = useState(false);
   const [newName, setNewName] = useState(userData.name);
-  const [error, setError] = useState('');
+  const [error, setError] = useState("Stryker was here!");
   const [newBanner, setNewBanner] = useState(userData.profileBanner);
   const [newProfilePic, setNewProfilePic] = useState(userData.profilePicture);

[Survived] BooleanLiteral
app/(tabs)/personal-storefront.tsx:62:66
   const [error, setError] = useState('');
   const [newBanner, setNewBanner] = useState(userData.profileBanner);
   const [newProfilePic, setNewProfilePic] = useState(userData.profilePicture);
-  const [isStatusModalVisible, setStatusModalVisible] = useState(false);
+  const [isStatusModalVisible, setStatusModalVisible] = useState(true);
   const [selectedItem, setSelectedItem] = useState(null);
   const [newStatus, setNewStatus] = useState('');

[Killed] BlockStatement
app/(tabs)/personal-storefront.tsx:66:35
   const [selectedItem, setSelectedItem] = useState(null);
   const [newStatus, setNewStatus] = useState('');
 
-  const updateName = (newName) => {
-    if (newName === '') {
-      setError('Name cannot be empty');
-      return;
-    }
-    setUserData(prevData => ({ ...prevData, name: newName }));
-    setNameModalVisible(false);
-    setError('');
-  };
+  const updateName = (newName) => {};
 
   const updateBanner = (newBanner) => {
killedBy: PersonalStorefrontPage should edit name
statusReason: Error: Unable to find an element with text: John Doe

<View>
  <Image />
  <View>
    <View
      testID="profileBannerIcon-container-outer-layer"
    >

[Killed] ConditionalExpression
app/(tabs)/personal-storefront.tsx:67:9
   const [newStatus, setNewStatus] = useState('');
 
   const updateName = (newName) => {
-    if (newName === '') {
+    if (true) {
       setError('Name cannot be empty');
       return;
killedBy: PersonalStorefrontPage should edit name
statusReason: Error: Unable to find an element with text: John Doe

<View>
  <Image />
  <View>
    <View
      testID="profileBannerIcon-container-outer-layer"
    >

[Killed] EqualityOperator
app/(tabs)/personal-storefront.tsx:67:9
   const [newStatus, setNewStatus] = useState('');
 
   const updateName = (newName) => {
-    if (newName === '') {
+    if (newName !== '') {
       setError('Name cannot be empty');
       return;
killedBy: PersonalStorefrontPage should edit name
statusReason: Error: Unable to find an element with text: John Doe

<View>
  <Image />
  <View>
    <View
      testID="profileBannerIcon-container-outer-layer"
    >

[Survived] StringLiteral
app/(tabs)/personal-storefront.tsx:68:16
 
   const updateName = (newName) => {
     if (newName === '') {
-      setError('Name cannot be empty');
+      setError("");
       return;
     }

[Killed] ArrowFunction
app/(tabs)/personal-storefront.tsx:71:17
       setError('Name cannot be empty');
       return;
     }
-    setUserData(prevData => ({ ...prevData, name: newName }));
+    setUserData(() => undefined);
     setNameModalVisible(false);
     setError('');
killedBy: PersonalStorefrontPage should edit name
statusReason: TypeError: Cannot read properties of undefined (reading 'name')

[Survived] BooleanLiteral
app/(tabs)/personal-storefront.tsx:72:25
       return;
     }
     setUserData(prevData => ({ ...prevData, name: newName }));
-    setNameModalVisible(false);
+    setNameModalVisible(true);
     setError('');
   };

[Survived] BlockStatement
app/(tabs)/personal-storefront.tsx:76:39
     setError('');
   };
 
-  const updateBanner = (newBanner) => {
-    setUserData(prevData => ({ ...prevData, profileBanner: newBanner }));
-  };
+  const updateBanner = (newBanner) => {};
 
   const updateProfilePic = (newProfilePic) => {

[Killed] ArrowFunction
app/(tabs)/personal-storefront.tsx:77:17
   };
 
   const updateBanner = (newBanner) => {
-    setUserData(prevData => ({ ...prevData, profileBanner: newBanner }));
+    setUserData(() => undefined);
   };
 
killedBy: PersonalStorefrontPage should change profile banner
statusReason: TypeError: Cannot read properties of undefined (reading 'name')

[Survived] BlockStatement
app/(tabs)/personal-storefront.tsx:80:47
     setUserData(prevData => ({ ...prevData, profileBanner: newBanner }));
   };
 
-  const updateProfilePic = (newProfilePic) => {
-    setUserData(prevData => ({ ...prevData, profilePicture: newProfilePic }));
-  };
+  const updateProfilePic = (newProfilePic) => {};
 
   const openStatusModal = (item) => {

[Killed] ArrowFunction
app/(tabs)/personal-storefront.tsx:81:17
   };
 
   const updateProfilePic = (newProfilePic) => {
-    setUserData(prevData => ({ ...prevData, profilePicture: newProfilePic }));
+    setUserData(() => undefined);
   };
 
killedBy: PersonalStorefrontPage should change profile picture
statusReason: TypeError: Cannot read properties of undefined (reading 'name')

[Survived] ObjectLiteral
app/(tabs)/personal-storefront.tsx:81:30
   };
 
   const updateProfilePic = (newProfilePic) => {
-    setUserData(prevData => ({ ...prevData, profilePicture: newProfilePic }));
+    setUserData(prevData => ({}));
   };
 

[Survived] BlockStatement
app/(tabs)/personal-storefront.tsx:84:37
     setUserData(prevData => ({ ...prevData, profilePicture: newProfilePic }));
   };
 
-  const openStatusModal = (item) => {
-    setSelectedItem(item);
-    setStatusModalVisible(true);
-  };
+  const openStatusModal = (item) => {};
 
   const updateStatus = (newStatus) => {

[Survived] BooleanLiteral
app/(tabs)/personal-storefront.tsx:86:27
 
   const openStatusModal = (item) => {
     setSelectedItem(item);
-    setStatusModalVisible(true);
+    setStatusModalVisible(false);
   };
 

[Survived] BlockStatement
app/(tabs)/personal-storefront.tsx:89:39
     setStatusModalVisible(true);
   };
 
-  const updateStatus = (newStatus) => {
-    if (selectedItem) {
-      const updatedItems = userItems.map(item => {
-        if (item.id === selectedItem.id) {
-          return { ...item, status: newStatus };
-        }
-        return item;
-      });
-      setUserItems(updatedItems);
-    }
-    setStatusModalVisible(false);
-  };
+  const updateStatus = (newStatus) => {};
 
   const renderItem = ({ item }) => (

[Survived] ConditionalExpression
app/(tabs)/personal-storefront.tsx:90:9
   };
 
   const updateStatus = (newStatus) => {
-    if (selectedItem) {
+    if (false) {
       const updatedItems = userItems.map(item => {
         if (item.id === selectedItem.id) {

[Survived] ConditionalExpression
app/(tabs)/personal-storefront.tsx:90:9
   };
 
   const updateStatus = (newStatus) => {
-    if (selectedItem) {
+    if (true) {
       const updatedItems = userItems.map(item => {
         if (item.id === selectedItem.id) {

[Survived] BlockStatement
app/(tabs)/personal-storefront.tsx:91:50
 
   const updateStatus = (newStatus) => {
     if (selectedItem) {
-      const updatedItems = userItems.map(item => {
-        if (item.id === selectedItem.id) {
-          return { ...item, status: newStatus };
-        }
-        return item;
-      });
+      const updatedItems = userItems.map(item => {});
       setUserItems(updatedItems);
     }

[Survived] EqualityOperator
app/(tabs)/personal-storefront.tsx:92:13
   const updateStatus = (newStatus) => {
     if (selectedItem) {
       const updatedItems = userItems.map(item => {
-        if (item.id === selectedItem.id) {
+        if (item.id !== selectedItem.id) {
           return { ...item, status: newStatus };
         }

[Survived] ConditionalExpression
app/(tabs)/personal-storefront.tsx:92:13
   const updateStatus = (newStatus) => {
     if (selectedItem) {
       const updatedItems = userItems.map(item => {
-        if (item.id === selectedItem.id) {
+        if (true) {
           return { ...item, status: newStatus };
         }

[Survived] ObjectLiteral
app/(tabs)/personal-storefront.tsx:93:18
     if (selectedItem) {
       const updatedItems = userItems.map(item => {
         if (item.id === selectedItem.id) {
-          return { ...item, status: newStatus };
+          return {};
         }
         return item;

[Survived] BooleanLiteral
app/(tabs)/personal-storefront.tsx:99:27
       });
       setUserItems(updatedItems);
     }
-    setStatusModalVisible(false);
+    setStatusModalVisible(true);
   };
 

[Killed] ArrowFunction
app/(tabs)/personal-storefront.tsx:102:22
     setStatusModalVisible(false);
   };
 
-  const renderItem = ({ item }) => (
-    <View style={styles.itemContainer}>
-      <Image source={item.itemImage} style={styles.itemImage} />
-      <View style={styles.itemDetails}>
-        <Text style={styles.itemName}>{item.itemName}</Text>
-        <Text style={styles.itemPrice}>{item.itemPrice}</Text>
-        <Text style={styles.category}>{item.category}</Text>
-        <TouchableOpacity onPress={() => openStatusModal(item)}>
-          <Text style={styles.itemStatus}>{item.status}</Text>
-        </TouchableOpacity>
-        {!item.pinned && (
-        <TouchableOpacity onPress={() => handlePinItem(item.id)} style={styles.pinButton} testID={"pinButton-" + item.id}>
-          <Text style={styles.pinButtonText}>Pin</Text>
-        </TouchableOpacity>
-      )}
-      </View>
-    </View>
-  );
+  const renderItem = () => undefined;
 
   const renderPinnedItem = ({ item }) => (
killedBy: PersonalStorefrontPage should pin an item
statusReason: Error: Unable to find an element with testID: pinButton-1

<View>
  <Image />
  <View>
    <View
      testID="profileBannerIcon-container-outer-layer"
    >

[Survived] ArrowFunction
app/(tabs)/personal-storefront.tsx:109:36
         <Text style={styles.itemName}>{item.itemName}</Text>
         <Text style={styles.itemPrice}>{item.itemPrice}</Text>
         <Text style={styles.category}>{item.category}</Text>
-        <TouchableOpacity onPress={() => openStatusModal(item)}>
+        <TouchableOpacity onPress={() => undefined}>
           <Text style={styles.itemStatus}>{item.status}</Text>
         </TouchableOpacity>

[Killed] LogicalOperator
app/(tabs)/personal-storefront.tsx:112:10
         <TouchableOpacity onPress={() => openStatusModal(item)}>
           <Text style={styles.itemStatus}>{item.status}</Text>
         </TouchableOpacity>
-        {!item.pinned && (
-        <TouchableOpacity onPress={() => handlePinItem(item.id)} style={styles.pinButton} testID={"pinButton-" + item.id}>
-          <Text style={styles.pinButtonText}>Pin</Text>
-        </TouchableOpacity>
-      )}
+        {!item.pinned || <TouchableOpacity onPress={() => handlePinItem(item.id)} style={styles.pinButton} testID={"pinButton-" + item.id}>
+          <Text style={styles.pinButtonText}>Pin</Text>
+        </TouchableOpacity>}
       </View>
     </View>
killedBy: PersonalStorefrontPage should pin an item
statusReason: Error: Unable to find an element with testID: pinButton-1

<View>
  <Image />
  <View>
    <View
      testID="profileBannerIcon-container-outer-layer"
    >

[Killed] ConditionalExpression
app/(tabs)/personal-storefront.tsx:112:10
         <TouchableOpacity onPress={() => openStatusModal(item)}>
           <Text style={styles.itemStatus}>{item.status}</Text>
         </TouchableOpacity>
-        {!item.pinned && (
-        <TouchableOpacity onPress={() => handlePinItem(item.id)} style={styles.pinButton} testID={"pinButton-" + item.id}>
-          <Text style={styles.pinButtonText}>Pin</Text>
-        </TouchableOpacity>
-      )}
+        {true}
       </View>
     </View>
killedBy: PersonalStorefrontPage should pin an item
statusReason: Error: Unable to find an element with testID: pinButton-1

<View>
  <Image />
  <View>
    <View
      testID="profileBannerIcon-container-outer-layer"
    >

[Killed] ArrowFunction
app/(tabs)/personal-storefront.tsx:113:36
           <Text style={styles.itemStatus}>{item.status}</Text>
         </TouchableOpacity>
         {!item.pinned && (
-        <TouchableOpacity onPress={() => handlePinItem(item.id)} style={styles.pinButton} testID={"pinButton-" + item.id}>
+        <TouchableOpacity onPress={() => undefined} style={styles.pinButton} testID={"pinButton-" + item.id}>
           <Text style={styles.pinButtonText}>Pin</Text>
         </TouchableOpacity>
killedBy: PersonalStorefrontPage should pin an item
statusReason: Error: Unable to find an element with text: Unpin

<View>
  <Image />
  <View>
    <View
      testID="profileBannerIcon-container-outer-layer"
    >

[Killed] ArrowFunction
app/(tabs)/personal-storefront.tsx:121:28
     </View>
   );
 
-  const renderPinnedItem = ({ item }) => (
-    <View style={styles.itemContainer}>  
-      <Image source={item.itemImage} style={styles.itemImage} />
-      <View style={styles.itemDetails}>
-        <Text style={styles.itemName}>{item.itemName}</Text>
-        <Text style={styles.itemPrice}>{item.itemPrice}</Text>  
-      </View>
-      <TouchableOpacity onPress={() => handleUnpinItem(item.id)} style={styles.unpinButton} testID = "unpinButton">
-        <Text style={styles.unpinButtonText}>Unpin</Text>
-      </TouchableOpacity>
-    </View>
-  );
+  const renderPinnedItem = () => undefined;
 
   const [pinnedItems, setPinnedItems] = useState([]);
killedBy: PersonalStorefrontPage should pin an item
statusReason: Error: Unable to find an element with text: Unpin

<View>
  <Image />
  <View>
    <View
      testID="profileBannerIcon-container-outer-layer"
    >

[Killed] ArrowFunction
app/(tabs)/personal-storefront.tsx:128:34
         <Text style={styles.itemName}>{item.itemName}</Text>
         <Text style={styles.itemPrice}>{item.itemPrice}</Text>  
       </View>
-      <TouchableOpacity onPress={() => handleUnpinItem(item.id)} style={styles.unpinButton} testID = "unpinButton">
+      <TouchableOpacity onPress={() => undefined} style={styles.unpinButton} testID = "unpinButton">
         <Text style={styles.unpinButtonText}>Unpin</Text>
       </TouchableOpacity>
killedBy: PersonalStorefrontPage should unpin an item
statusReason: Error: Unable to find an element with testID: pinButton-1

<View>
  <Image />
  <View>
    <View
      testID="profileBannerIcon-container-outer-layer"
    >

[Killed] BlockStatement
app/(tabs)/personal-storefront.tsx:136:37
 
   const [pinnedItems, setPinnedItems] = useState([]);
 
-  const handlePinItem = (itemId) => {
-    const updatedUserItems = userItems.map(item => {
-      if (item.id === itemId) {
-        return { ...item, pinned: true };
-      }
-      return item;
-    });
-    setUserItems(updatedUserItems);
-    const itemToPin = userItems.find(item => item.id === itemId);
-    if (itemToPin) {
-      if (pinnedItems.length < 3) {
-        setPinnedItems([...pinnedItems, itemToPin]);
-      } else {
-        alert("You've reached your pin limit");
-      }
-    }
-  };
+  const handlePinItem = (itemId) => {};
   
   const handleUnpinItem = (itemId) => {
killedBy: PersonalStorefrontPage should pin an item
statusReason: Error: Unable to find an element with text: Unpin

<View>
  <Image />
  <View>
    <View
      testID="profileBannerIcon-container-outer-layer"
    >

[Killed] BlockStatement
app/(tabs)/personal-storefront.tsx:137:52
   const [pinnedItems, setPinnedItems] = useState([]);
 
   const handlePinItem = (itemId) => {
-    const updatedUserItems = userItems.map(item => {
-      if (item.id === itemId) {
-        return { ...item, pinned: true };
-      }
-      return item;
-    });
+    const updatedUserItems = userItems.map(item => {});
     setUserItems(updatedUserItems);
     const itemToPin = userItems.find(item => item.id === itemId);
killedBy: PersonalStorefrontPage should pin an item
statusReason: TypeError: Cannot read properties of undefined (reading 'category')

[Survived] BlockStatement
app/(tabs)/personal-storefront.tsx:138:31
 
   const handlePinItem = (itemId) => {
     const updatedUserItems = userItems.map(item => {
-      if (item.id === itemId) {
-        return { ...item, pinned: true };
-      }
+      if (item.id === itemId) {}
       return item;
     });

[Survived] ConditionalExpression
app/(tabs)/personal-storefront.tsx:138:11
 
   const handlePinItem = (itemId) => {
     const updatedUserItems = userItems.map(item => {
-      if (item.id === itemId) {
+      if (false) {
         return { ...item, pinned: true };
       }

[Survived] BooleanLiteral
app/(tabs)/personal-storefront.tsx:139:35
   const handlePinItem = (itemId) => {
     const updatedUserItems = userItems.map(item => {
       if (item.id === itemId) {
-        return { ...item, pinned: true };
+        return { ...item, pinned: false };
       }
       return item;

[Killed] ConditionalExpression
app/(tabs)/personal-storefront.tsx:144:46
       return item;
     });
     setUserItems(updatedUserItems);
-    const itemToPin = userItems.find(item => item.id === itemId);
+    const itemToPin = userItems.find(item => false);
     if (itemToPin) {
       if (pinnedItems.length < 3) {
killedBy: PersonalStorefrontPage should pin an item
statusReason: Error: Unable to find an element with text: Unpin

<View>
  <Image />
  <View>
    <View
      testID="profileBannerIcon-container-outer-layer"
    >

[Killed] ArrowFunction
app/(tabs)/personal-storefront.tsx:144:38
       return item;
     });
     setUserItems(updatedUserItems);
-    const itemToPin = userItems.find(item => item.id === itemId);
+    const itemToPin = userItems.find(() => undefined);
     if (itemToPin) {
       if (pinnedItems.length < 3) {
killedBy: PersonalStorefrontPage should pin an item
statusReason: Error: Unable to find an element with text: Unpin

<View>
  <Image />
  <View>
    <View
      testID="profileBannerIcon-container-outer-layer"
    >

[Killed] ConditionalExpression
app/(tabs)/personal-storefront.tsx:145:9
     });
     setUserItems(updatedUserItems);
     const itemToPin = userItems.find(item => item.id === itemId);
-    if (itemToPin) {
+    if (false) {
       if (pinnedItems.length < 3) {
         setPinnedItems([...pinnedItems, itemToPin]);
killedBy: PersonalStorefrontPage should pin an item
statusReason: Error: Unable to find an element with text: Unpin

<View>
  <Image />
  <View>
    <View
      testID="profileBannerIcon-container-outer-layer"
    >

[Killed] BlockStatement
app/(tabs)/personal-storefront.tsx:145:20
     });
     setUserItems(updatedUserItems);
     const itemToPin = userItems.find(item => item.id === itemId);
-    if (itemToPin) {
-      if (pinnedItems.length < 3) {
-        setPinnedItems([...pinnedItems, itemToPin]);
-      } else {
-        alert("You've reached your pin limit");
-      }
-    }
+    if (itemToPin) {}
   };
   
killedBy: PersonalStorefrontPage should pin an item
statusReason: Error: Unable to find an element with text: Unpin

<View>
  <Image />
  <View>
    <View
      testID="profileBannerIcon-container-outer-layer"
    >

[Killed] ConditionalExpression
app/(tabs)/personal-storefront.tsx:146:11
     setUserItems(updatedUserItems);
     const itemToPin = userItems.find(item => item.id === itemId);
     if (itemToPin) {
-      if (pinnedItems.length < 3) {
+      if (false) {
         setPinnedItems([...pinnedItems, itemToPin]);
       } else {
killedBy: PersonalStorefrontPage should pin an item
statusReason: ReferenceError: alert is not defined

[Killed] BlockStatement
app/(tabs)/personal-storefront.tsx:146:35
     setUserItems(updatedUserItems);
     const itemToPin = userItems.find(item => item.id === itemId);
     if (itemToPin) {
-      if (pinnedItems.length < 3) {
-        setPinnedItems([...pinnedItems, itemToPin]);
-      } else {
+      if (pinnedItems.length < 3) {} else {
         alert("You've reached your pin limit");
       }
killedBy: PersonalStorefrontPage should pin an item
statusReason: Error: Unable to find an element with text: Unpin

<View>
  <Image />
  <View>
    <View
      testID="profileBannerIcon-container-outer-layer"
    >

[Killed] ArrayDeclaration
app/(tabs)/personal-storefront.tsx:147:24
     const itemToPin = userItems.find(item => item.id === itemId);
     if (itemToPin) {
       if (pinnedItems.length < 3) {
-        setPinnedItems([...pinnedItems, itemToPin]);
+        setPinnedItems([]);
       } else {
         alert("You've reached your pin limit");
killedBy: PersonalStorefrontPage should pin an item
statusReason: Error: Unable to find an element with text: Unpin

<View>
  <Image />
  <View>
    <View
      testID="profileBannerIcon-container-outer-layer"
    >
