[Survived] BlockStatement
app/(tabs)/personal-storefront.tsx:148:14
     if (itemToPin) {
       if (pinnedItems.length < 3) {
         setPinnedItems([...pinnedItems, itemToPin]);
-      } else {
-        alert("You've reached your pin limit");
-      }
+      } else {}
     }
   };

[Killed] BlockStatement
app/(tabs)/personal-storefront.tsx:154:39
     }
   };
   
-  const handleUnpinItem = (itemId) => {
-    const updatedUserItems = userItems.map(item => {
-      if (item.id === itemId) {
-        return { ...item, pinned: false };
-      }
-      return item;
-    });
-    setUserItems(updatedUserItems);
-    const updatedPinnedItems = pinnedItems.filter(item => item.id !== itemId);
-    setPinnedItems(updatedPinnedItems);
-  };
+  const handleUnpinItem = (itemId) => {};
 
 
killedBy: PersonalStorefrontPage should unpin an item
statusReason: Error: Unable to find an element with testID: pinButton-1

<View>
  <Image />
  <View>
    <View
      testID="profileBannerIcon-container-outer-layer"
    >

[Killed] BlockStatement
app/(tabs)/personal-storefront.tsx:155:52
   };
   
   const handleUnpinItem = (itemId) => {
-    const updatedUserItems = userItems.map(item => {
-      if (item.id === itemId) {
-        return { ...item, pinned: false };
-      }
-      return item;
-    });
+    const updatedUserItems = userItems.map(item => {});
     setUserItems(updatedUserItems);
     const updatedPinnedItems = pinnedItems.filter(item => item.id !== itemId);
killedBy: PersonalStorefrontPage should unpin an item
statusReason: TypeError: Cannot read properties of undefined (reading 'category')

[Killed] EqualityOperator
app/(tabs)/personal-storefront.tsx:156:11
   
   const handleUnpinItem = (itemId) => {
     const updatedUserItems = userItems.map(item => {
-      if (item.id === itemId) {
+      if (item.id !== itemId) {
         return { ...item, pinned: false };
       }
killedBy: PersonalStorefrontPage should unpin an item
statusReason: Error: Unable to find an element with testID: pinButton-1

<View>
  <Image />
  <View>
    <View
      testID="profileBannerIcon-container-outer-layer"
    >

[Killed] BooleanLiteral
app/(tabs)/personal-storefront.tsx:157:35
   const handleUnpinItem = (itemId) => {
     const updatedUserItems = userItems.map(item => {
       if (item.id === itemId) {
-        return { ...item, pinned: false };
+        return { ...item, pinned: true };
       }
       return item;
killedBy: PersonalStorefrontPage should unpin an item
statusReason: Error: Unable to find an element with testID: pinButton-1

<View>
  <Image />
  <View>
    <View
      testID="profileBannerIcon-container-outer-layer"
    >

[Survived] ArrowFunction
app/(tabs)/personal-storefront.tsx:162:51
       return item;
     });
     setUserItems(updatedUserItems);
-    const updatedPinnedItems = pinnedItems.filter(item => item.id !== itemId);
+    const updatedPinnedItems = pinnedItems.filter(() => undefined);
     setPinnedItems(updatedPinnedItems);
   };

[Survived] ConditionalExpression
app/(tabs)/personal-storefront.tsx:162:59
       return item;
     });
     setUserItems(updatedUserItems);
-    const updatedPinnedItems = pinnedItems.filter(item => item.id !== itemId);
+    const updatedPinnedItems = pinnedItems.filter(item => false);
     setPinnedItems(updatedPinnedItems);
   };

[Killed] ArrowFunction
app/(tabs)/personal-storefront.tsx:175:20
           icon="brush"
           color="#fff"
           size={25}
-          onPress={() => setBannerModalVisible(true)}
+          onPress={() => undefined}
           testID='profileBannerIcon'
         />
killedBy: PersonalStorefrontPage should change profile banner
statusReason: Error: Unable to find an element with text: Save

<View>
  <Image />
  <View>
    <View
      testID="profileBannerIcon-container-outer-layer"
    >

[Killed] BooleanLiteral
app/(tabs)/personal-storefront.tsx:175:48
           icon="brush"
           color="#fff"
           size={25}
-          onPress={() => setBannerModalVisible(true)}
+          onPress={() => setBannerModalVisible(false)}
           testID='profileBannerIcon'
         />
killedBy: PersonalStorefrontPage should change profile banner
statusReason: Error: Unable to find an element with text: Save

<View>
  <Image />
  <View>
    <View
      testID="profileBannerIcon-container-outer-layer"
    >

[Killed] ArrowFunction
app/(tabs)/personal-storefront.tsx:186:22
             icon="image-edit"
             color="#fff"
             size={25}
-            onPress={() => setProfilePicModalVisible(true)}
+            onPress={() => undefined}
             testID='profilePictureIcon'
             style={styles.profilePictureIconContainer}
killedBy: PersonalStorefrontPage should change profile picture
statusReason: Error: Unable to find an element with text: Save

<View>
  <Image />
  <View>
    <View
      testID="profileBannerIcon-container-outer-layer"
    >

[Killed] BooleanLiteral
app/(tabs)/personal-storefront.tsx:186:54
             icon="image-edit"
             color="#fff"
             size={25}
-            onPress={() => setProfilePicModalVisible(true)}
+            onPress={() => setProfilePicModalVisible(false)}
             testID='profilePictureIcon'
             style={styles.profilePictureIconContainer}
killedBy: PersonalStorefrontPage should change profile picture
statusReason: Error: Unable to find an element with text: Save

<View>
  <Image />
  <View>
    <View
      testID="profileBannerIcon-container-outer-layer"
    >

[Killed] BooleanLiteral
app/(tabs)/personal-storefront.tsx:198:50
               icon="pencil"
               color="#fff"
               size={20}
-              onPress={() => setNameModalVisible(true)}
+              onPress={() => setNameModalVisible(false)}
               testID='editButton'
             />
killedBy: PersonalStorefrontPage should edit name
statusReason: Error: Unable to find an element with placeholder: Enter new name

<View>
  <Image />
  <View>
    <View
      testID="profileBannerIcon-container-outer-layer"
    >

[Killed] ArrowFunction
app/(tabs)/personal-storefront.tsx:198:24
               icon="pencil"
               color="#fff"
               size={20}
-              onPress={() => setNameModalVisible(true)}
+              onPress={() => undefined}
               testID='editButton'
             />
killedBy: PersonalStorefrontPage should edit name
statusReason: Error: Unable to find an element with placeholder: Enter new name

<View>
  <Image />
  <View>
    <View
      testID="profileBannerIcon-container-outer-layer"
    >

[Survived] ArrowFunction
app/(tabs)/personal-storefront.tsx:212:25
         animationType="slide"
         transparent={true}
         visible={isNameModalVisible}
-        onRequestClose={() => setNameModalVisible(false)}
+        onRequestClose={() => undefined}
       >
         <View style={styles.modalContainer}>

[Survived] BooleanLiteral
app/(tabs)/personal-storefront.tsx:212:51
         animationType="slide"
         transparent={true}
         visible={isNameModalVisible}
-        onRequestClose={() => setNameModalVisible(false)}
+        onRequestClose={() => setNameModalVisible(true)}
       >
         <View style={styles.modalContainer}>

[Survived] ArrowFunction
app/(tabs)/personal-storefront.tsx:225:42
             />
             {error ? <Text style={styles.errorMsg}>{error}</Text> : null}
             <View style={styles.modalButtons}>
-              <TouchableOpacity onPress={() => setNameModalVisible(false)}>
+              <TouchableOpacity onPress={() => undefined}>
                 <Text style={styles.modalButton}>Cancel</Text>
               </TouchableOpacity>

[Survived] BooleanLiteral
app/(tabs)/personal-storefront.tsx:225:68
             />
             {error ? <Text style={styles.errorMsg}>{error}</Text> : null}
             <View style={styles.modalButtons}>
-              <TouchableOpacity onPress={() => setNameModalVisible(false)}>
+              <TouchableOpacity onPress={() => setNameModalVisible(true)}>
                 <Text style={styles.modalButton}>Cancel</Text>
               </TouchableOpacity>

[Killed] BlockStatement
app/(tabs)/personal-storefront.tsx:228:48
               <TouchableOpacity onPress={() => setNameModalVisible(false)}>
                 <Text style={styles.modalButton}>Cancel</Text>
               </TouchableOpacity>
-              <TouchableOpacity onPress={() => { updateName(newName); }} testID='saveButton'>
+              <TouchableOpacity onPress={() => {}} testID='saveButton'>
                 <Text style={styles.modalButton}>Save</Text>
               </TouchableOpacity>
killedBy: PersonalStorefrontPage should edit name
statusReason: Error: Unable to find an element with text: John Doe

<View>
  <Image />
  <View>
    <View
      testID="profileBannerIcon-container-outer-layer"
    >

[Survived] BooleanLiteral
app/(tabs)/personal-storefront.tsx:241:53
         animationType="slide"
         transparent={true}
         visible={isBannerModalVisible}
-        onRequestClose={() => setBannerModalVisible(false)}
+        onRequestClose={() => setBannerModalVisible(true)}
       >
         <View style={styles.modalContainer}>

[Survived] ArrowFunction
app/(tabs)/personal-storefront.tsx:241:25
         animationType="slide"
         transparent={true}
         visible={isBannerModalVisible}
-        onRequestClose={() => setBannerModalVisible(false)}
+        onRequestClose={() => undefined}
       >
         <View style={styles.modalContainer}>

[Survived] BooleanLiteral
app/(tabs)/personal-storefront.tsx:246:55
         <View style={styles.modalContainer}>
           <View style={styles.modalContent}>
             <Text style={styles.modalTitle}>Select Banner</Text>
-            <ScrollView showsVerticalScrollIndicator={true} style={styles.bannerColumns}>
+            <ScrollView showsVerticalScrollIndicator={false} style={styles.bannerColumns}>
               {banners.map((banner, index) => (
                 <TouchableOpacity key={index} onPress={() => setNewBanner(banner)}>

[Survived] ArrowFunction
app/(tabs)/personal-storefront.tsx:247:28
           <View style={styles.modalContent}>
             <Text style={styles.modalTitle}>Select Banner</Text>
             <ScrollView showsVerticalScrollIndicator={true} style={styles.bannerColumns}>
-              {banners.map((banner, index) => (
-                <TouchableOpacity key={index} onPress={() => setNewBanner(banner)}>
-                  <Image source={banner} style={styles.bannerPreview} />
-                </TouchableOpacity>
-              ))}
+              {banners.map(() => undefined)}
             </ScrollView>
             <View style={styles.modalButtons}>

[Survived] ArrowFunction
app/(tabs)/personal-storefront.tsx:248:56
             <Text style={styles.modalTitle}>Select Banner</Text>
             <ScrollView showsVerticalScrollIndicator={true} style={styles.bannerColumns}>
               {banners.map((banner, index) => (
-                <TouchableOpacity key={index} onPress={() => setNewBanner(banner)}>
+                <TouchableOpacity key={index} onPress={() => undefined}>
                   <Image source={banner} style={styles.bannerPreview} />
                 </TouchableOpacity>

[Survived] BooleanLiteral
app/(tabs)/personal-storefront.tsx:254:70
               ))}
             </ScrollView>
             <View style={styles.modalButtons}>
-              <TouchableOpacity onPress={() => setBannerModalVisible(false)}>
+              <TouchableOpacity onPress={() => setBannerModalVisible(true)}>
                 <Text style={styles.modalButton}>Cancel</Text>
               </TouchableOpacity>

[Survived] ArrowFunction
app/(tabs)/personal-storefront.tsx:254:42
               ))}
             </ScrollView>
             <View style={styles.modalButtons}>
-              <TouchableOpacity onPress={() => setBannerModalVisible(false)}>
+              <TouchableOpacity onPress={() => undefined}>
                 <Text style={styles.modalButton}>Cancel</Text>
               </TouchableOpacity>

[Survived] BlockStatement
app/(tabs)/personal-storefront.tsx:257:48
               <TouchableOpacity onPress={() => setBannerModalVisible(false)}>
                 <Text style={styles.modalButton}>Cancel</Text>
               </TouchableOpacity>
-              <TouchableOpacity onPress={() => { updateBanner(newBanner); setBannerModalVisible(false); }}>
+              <TouchableOpacity onPress={() => {}}>
                 <Text style={styles.modalButton}>Save</Text>
               </TouchableOpacity>

[Survived] BooleanLiteral
app/(tabs)/personal-storefront.tsx:257:97
               <TouchableOpacity onPress={() => setBannerModalVisible(false)}>
                 <Text style={styles.modalButton}>Cancel</Text>
               </TouchableOpacity>
-              <TouchableOpacity onPress={() => { updateBanner(newBanner); setBannerModalVisible(false); }}>
+              <TouchableOpacity onPress={() => { updateBanner(newBanner); setBannerModalVisible(true); }}>
                 <Text style={styles.modalButton}>Save</Text>
               </TouchableOpacity>

[Survived] BooleanLiteral
app/(tabs)/personal-storefront.tsx:270:57
         animationType="slide"
         transparent={true}
         visible={isProfilePicModalVisible}
-        onRequestClose={() => setProfilePicModalVisible(false)}
+        onRequestClose={() => setProfilePicModalVisible(true)}
       >
         <View style={styles.modalContainer}>

[Survived] ArrowFunction
app/(tabs)/personal-storefront.tsx:270:25
         animationType="slide"
         transparent={true}
         visible={isProfilePicModalVisible}
-        onRequestClose={() => setProfilePicModalVisible(false)}
+        onRequestClose={() => undefined}
       >
         <View style={styles.modalContainer}>

[Survived] BooleanLiteral
app/(tabs)/personal-storefront.tsx:275:75
         <View style={styles.modalContainer}>
           <View style={styles.modalContent}>
             <Text style={styles.modalTitle}>Select Profile Picture</Text>
-            <ScrollView horizontal={true} showsHorizontalScrollIndicator={true} style={styles.pictureRow}>
+            <ScrollView horizontal={true} showsHorizontalScrollIndicator={false} style={styles.pictureRow}>
               {profilePictures.map((image, index) => (
                 <TouchableOpacity key={index} onPress={() => setNewProfilePic(image)}>

[Survived] BooleanLiteral
app/(tabs)/personal-storefront.tsx:275:37
         <View style={styles.modalContainer}>
           <View style={styles.modalContent}>
             <Text style={styles.modalTitle}>Select Profile Picture</Text>
-            <ScrollView horizontal={true} showsHorizontalScrollIndicator={true} style={styles.pictureRow}>
+            <ScrollView horizontal={false} showsHorizontalScrollIndicator={true} style={styles.pictureRow}>
               {profilePictures.map((image, index) => (
                 <TouchableOpacity key={index} onPress={() => setNewProfilePic(image)}>

[Survived] ArrowFunction
app/(tabs)/personal-storefront.tsx:276:36
           <View style={styles.modalContent}>
             <Text style={styles.modalTitle}>Select Profile Picture</Text>
             <ScrollView horizontal={true} showsHorizontalScrollIndicator={true} style={styles.pictureRow}>
-              {profilePictures.map((image, index) => (
-                <TouchableOpacity key={index} onPress={() => setNewProfilePic(image)}>
-                  <Image source={image} style={styles.picturePreview} />
-                </TouchableOpacity>
-              ))}
+              {profilePictures.map(() => undefined)}
             </ScrollView>
             <View style={styles.modalButtons}>

[Survived] ArrowFunction
app/(tabs)/personal-storefront.tsx:277:56
             <Text style={styles.modalTitle}>Select Profile Picture</Text>
             <ScrollView horizontal={true} showsHorizontalScrollIndicator={true} style={styles.pictureRow}>
               {profilePictures.map((image, index) => (
-                <TouchableOpacity key={index} onPress={() => setNewProfilePic(image)}>
+                <TouchableOpacity key={index} onPress={() => undefined}>
                   <Image source={image} style={styles.picturePreview} />
                 </TouchableOpacity>

[Survived] ArrowFunction
app/(tabs)/personal-storefront.tsx:283:42
               ))}
             </ScrollView>
             <View style={styles.modalButtons}>
-              <TouchableOpacity onPress={() => setProfilePicModalVisible(false)}>
+              <TouchableOpacity onPress={() => undefined}>
                 <Text style={styles.modalButton}>Cancel</Text>
               </TouchableOpacity>

[Survived] BooleanLiteral
app/(tabs)/personal-storefront.tsx:283:74
               ))}
             </ScrollView>
             <View style={styles.modalButtons}>
-              <TouchableOpacity onPress={() => setProfilePicModalVisible(false)}>
+              <TouchableOpacity onPress={() => setProfilePicModalVisible(true)}>
                 <Text style={styles.modalButton}>Cancel</Text>
               </TouchableOpacity>

[Survived] BlockStatement
app/(tabs)/personal-storefront.tsx:286:48
               <TouchableOpacity onPress={() => setProfilePicModalVisible(false)}>
                 <Text style={styles.modalButton}>Cancel</Text>
               </TouchableOpacity>
-              <TouchableOpacity onPress={() => { updateProfilePic(newProfilePic); setProfilePicModalVisible(false); }}>
+              <TouchableOpacity onPress={() => {}}>
                 <Text style={styles.modalButton}>Save</Text>
               </TouchableOpacity>

[Survived] BooleanLiteral
app/(tabs)/personal-storefront.tsx:286:109
               <TouchableOpacity onPress={() => setProfilePicModalVisible(false)}>
                 <Text style={styles.modalButton}>Cancel</Text>
               </TouchableOpacity>
-              <TouchableOpacity onPress={() => { updateProfilePic(newProfilePic); setProfilePicModalVisible(false); }}>
+              <TouchableOpacity onPress={() => { updateProfilePic(newProfilePic); setProfilePicModalVisible(true); }}>
                 <Text style={styles.modalButton}>Save</Text>
               </TouchableOpacity>

[Survived] BooleanLiteral
app/(tabs)/personal-storefront.tsx:299:53
         animationType="slide"
         transparent={true}
         visible={isStatusModalVisible}
-        onRequestClose={() => setStatusModalVisible(false)}
+        onRequestClose={() => setStatusModalVisible(true)}
       >
         <View style={styles.modalContainer}>

[Survived] ArrowFunction
app/(tabs)/personal-storefront.tsx:299:25
         animationType="slide"
         transparent={true}
         visible={isStatusModalVisible}
-        onRequestClose={() => setStatusModalVisible(false)}
+        onRequestClose={() => undefined}
       >
         <View style={styles.modalContainer}>

[Survived] ArrowFunction
app/(tabs)/personal-storefront.tsx:304:40
         <View style={styles.modalContainer}>
           <View style={styles.modalContent}>
             <Text style={styles.modalTitle}>Edit Status</Text>
-            <TouchableOpacity onPress={() => updateStatus('In Stock')}>
+            <TouchableOpacity onPress={() => undefined}>
               <Text style={styles.modalOption}>In Stock</Text>
             </TouchableOpacity>

[Survived] StringLiteral
app/(tabs)/personal-storefront.tsx:304:59
         <View style={styles.modalContainer}>
           <View style={styles.modalContent}>
             <Text style={styles.modalTitle}>Edit Status</Text>
-            <TouchableOpacity onPress={() => updateStatus('In Stock')}>
+            <TouchableOpacity onPress={() => updateStatus("")}>
               <Text style={styles.modalOption}>In Stock</Text>
             </TouchableOpacity>

[Survived] ArrowFunction
app/(tabs)/personal-storefront.tsx:307:40
             <TouchableOpacity onPress={() => updateStatus('In Stock')}>
               <Text style={styles.modalOption}>In Stock</Text>
             </TouchableOpacity>
-            <TouchableOpacity onPress={() => updateStatus('Out of Stock')}>
+            <TouchableOpacity onPress={() => undefined}>
               <Text style={styles.modalOption}>Out of Stock</Text>
             </TouchableOpacity>

[Survived] ArrowFunction
app/(tabs)/personal-storefront.tsx:310:40
             <TouchableOpacity onPress={() => updateStatus('Out of Stock')}>
               <Text style={styles.modalOption}>Out of Stock</Text>
             </TouchableOpacity>
-            <TouchableOpacity onPress={() => updateStatus('Unavailable')}>
+            <TouchableOpacity onPress={() => undefined}>
               <Text style={styles.modalOption}>Unavailable</Text>
             </TouchableOpacity>

[Survived] ArrowFunction
app/(tabs)/personal-storefront.tsx:313:40
             <TouchableOpacity onPress={() => updateStatus('Unavailable')}>
               <Text style={styles.modalOption}>Unavailable</Text>
             </TouchableOpacity>
-            <TouchableOpacity onPress={() => setStatusModalVisible(false)}>
+            <TouchableOpacity onPress={() => undefined}>
               <Text style={styles.modalButton}>Cancel</Text>
             </TouchableOpacity>

[Survived] BooleanLiteral
app/(tabs)/personal-storefront.tsx:313:68
             <TouchableOpacity onPress={() => updateStatus('Unavailable')}>
               <Text style={styles.modalOption}>Unavailable</Text>
             </TouchableOpacity>
-            <TouchableOpacity onPress={() => setStatusModalVisible(false)}>
+            <TouchableOpacity onPress={() => setStatusModalVisible(true)}>
               <Text style={styles.modalButton}>Cancel</Text>
             </TouchableOpacity>

[Killed] ArrowFunction
app/(tabs)/personal-storefront.tsx:321:24
       </Modal>
 
       <Text style={styles.listingsHeading}>Pinned Listings</Text>
-      {pinnedItems.map(pinnedItem => (
-        <View key={pinnedItem.id}>
-          {renderPinnedItem({ item: pinnedItem })}
-        </View>
-      ))}
+      {pinnedItems.map(() => undefined)}
 
       <Text style={styles.listingsHeading}>Listings</Text>
killedBy: PersonalStorefrontPage should pin an item
statusReason: Error: Unable to find an element with text: Unpin

<View>
  <Image />
  <View>
    <View
      testID="profileBannerIcon-container-outer-layer"
    >

[Killed] ObjectLiteral
app/(tabs)/personal-storefront.tsx:323:29
       <Text style={styles.listingsHeading}>Pinned Listings</Text>
       {pinnedItems.map(pinnedItem => (
         <View key={pinnedItem.id}>
-          {renderPinnedItem({ item: pinnedItem })}
+          {renderPinnedItem({})}
         </View>
       ))}
killedBy: PersonalStorefrontPage should pin an item
statusReason: TypeError: Cannot read properties of undefined (reading 'itemImage')

[Survived] ObjectLiteral
app/(tabs)/personal-storefront.tsx:344:18
     alignItems: 'flex-start',
     padding: 20,
   },
-  profileBanner: {
-    width: '100%',
-    height: 150,
-    resizeMode: 'cover',
-  },
+  profileBanner: {},
   profileBannerIconContainer: {
     position: 'absolute',

[Survived] StringLiteral
app/(tabs)/personal-storefront.tsx:345:12
     padding: 20,
   },
   profileBanner: {
-    width: '100%',
+    width: "",
     height: 150,
     resizeMode: 'cover',

[Survived] UnaryOperator
app/(tabs)/personal-storefront.tsx:351:12
   },
   profileBannerIconContainer: {
     position: 'absolute',
-    right: -10,
+    right: +10,
     top: 0,
   },

[Survived] StringLiteral
app/(tabs)/personal-storefront.tsx:355:20
     top: 0,
   },
   profileContainer: {
-    flexDirection: 'row',
+    flexDirection: "",
     alignItems: 'center',
     marginTop: -70,

[Survived] UnaryOperator
app/(tabs)/personal-storefront.tsx:357:16
   profileContainer: {
     flexDirection: 'row',
     alignItems: 'center',
-    marginTop: -70,
+    marginTop: +70,
     marginBottom: 20,
   },

[Survived] ObjectLiteral
app/(tabs)/personal-storefront.tsx:360:19
     marginTop: -70,
     marginBottom: 20,
   },
-  profilePicture: {
-    width: '100%',
-    height: '100%',
-    borderRadius: 50,
-    borderWidth: 2,
-    borderColor: '#fff',
-  },
+  profilePicture: {},
   profilePictureAndIconContainer: {
     position: 'relative',

[Survived] StringLiteral
app/(tabs)/personal-storefront.tsx:374:15
     height: 100,
   },
   profilePictureIconContainer: {
-    position: 'absolute',
+    position: "",
     left: 70,
     top: 60,

[Survived] ObjectLiteral
app/(tabs)/personal-storefront.tsx:382:16
     justifyContent: 'center',
     marginTop: 60,
   },
-  profileName: {
-    fontSize: 18,
-    fontWeight: 'bold',
-  },
+  profileName: {},
   profileNameAndIconContainer: {
     flexDirection: 'row',

[Survived] UnaryOperator
app/(tabs)/personal-storefront.tsx:389:19
   profileNameAndIconContainer: {
     flexDirection: 'row',
     alignItems: 'center',
-    marginBottom: -10,
+    marginBottom: +10,
   },
   profileStatus: {

[Survived] ObjectLiteral
app/(tabs)/personal-storefront.tsx:395:19
     fontSize: 16,
     color: '#888',
   },
-  profileRatings: {
-    fontSize: 20,
-  },
+  profileRatings: {},
   listingsHeading: {
     fontSize: 20,

[Survived] ObjectLiteral
app/(tabs)/personal-storefront.tsx:417:16
     borderRadius: 8,
     marginRight: 15,
   },
-  itemDetails: {
-    flex: 1,
-  },
+  itemDetails: {},
   itemName: {
     fontSize: 16,

[Survived] StringLiteral
app/(tabs)/personal-storefront.tsx:430:12
   },
   category: {
     fontSize: 14,
-    color: '#888',
+    color: "",
   },
   itemStatus: {

[Survived] ObjectLiteral
app/(tabs)/personal-storefront.tsx:432:15
     fontSize: 14,
     color: '#888',
   },
-  itemStatus: {
-    fontSize: 14,
-    color: '#888',
-  },
+  itemStatus: {},
   modalContainer: {
     flex: 1,

[Survived] StringLiteral
app/(tabs)/personal-storefront.tsx:440:22
     flex: 1,
     justifyContent: 'center',
     alignItems: 'center',
-    backgroundColor: 'rgba(0, 0, 0, 0.5)',
+    backgroundColor: "",
   },
   modalContent: {

[Survived] StringLiteral
app/(tabs)/personal-storefront.tsx:447:16
     borderRadius: 8,
     padding: 20,
     width: '35%',
-    maxHeight: '80%',
+    maxHeight: "",
   },
   modalTitle: {

[Survived] StringLiteral
app/(tabs)/personal-storefront.tsx:467:12
   },
   modalButton: {
     fontSize: 16,
-    color: '#41a425',
+    color: "",
   },
   modalOption: {

[Survived] ObjectLiteral
app/(tabs)/personal-storefront.tsx:474:18
     color: '#333',
     marginBottom: 15,
   },
-  bannerColumns: {
-    height: 200,
-    marginBottom: 10,
-    paddingRight: 10,
-  },
+  bannerColumns: {},
   bannerPreview: {
     width: '100%',

[Survived] ObjectLiteral
app/(tabs)/personal-storefront.tsx:503:14
     fontSize: 16,
     marginBottom: 20,
   },
-  pinButton: {
-    flex: 1,
-    top: 0,
-    right: 0,
-    backgroundColor: '#007bff',
-    width: 30,
-    height: 30,
-    justifyContent: 'center',
-    alignItems: 'center',
-    borderRadius: 5,
-  },
+  pinButton: {},
   pinButtonText: {
     color: '#fff',

[Survived] ObjectLiteral
app/(tabs)/personal-storefront.tsx:514:18
     alignItems: 'center',
     borderRadius: 5,
   },
-  pinButtonText: {
-    color: '#fff',
-  },
+  pinButtonText: {},
   unpinButton: {
     flex: 1,

[Survived] ObjectLiteral
app/(tabs)/personal-storefront.tsx:517:16
   pinButtonText: {
     color: '#fff',
   },
-  unpinButton: {
-    flex: 1,
-    top: 0,
-    right: 0,
-    backgroundColor: '#b90e0a',
-    width: 30,
-    height: 30,
-    justifyContent: 'center',
-    alignItems: 'center',
-    borderRadius: 5,
-  },
+  unpinButton: {},
   unpinButtonText: {
     color: '#fff',

[Survived] StringLiteral
app/(tabs)/personal-storefront.tsx:521:22
     flex: 1,
     top: 0,
     right: 0,
-    backgroundColor: '#b90e0a',
+    backgroundColor: "",
     width: 30,
     height: 30,

[Survived] StringLiteral
app/(tabs)/personal-storefront.tsx:524:21
     backgroundColor: '#b90e0a',
     width: 30,
     height: 30,
-    justifyContent: 'center',
+    justifyContent: "",
     alignItems: 'center',
     borderRadius: 5,

[Survived] ObjectLiteral
app/(tabs)/personal-storefront.tsx:528:20
     alignItems: 'center',
     borderRadius: 5,
   },
-  unpinButtonText: {
-    color: '#fff',
-  },
+  unpinButtonText: {},
 });
 
